; domain
(define (domain problem1)

    (:requirements :strips :typing :disjunctive-preconditions :equality :quantified-preconditions :conditional-effects)

    (:types
        robot - object
        box - object
        location - object
        workstation - object
        content - object
    )

    (:constants
        central_warehouse - location
        central_warehouse_contents - workstation
    )

    (:predicates
        (rob_at_loc ?r - robot ?l - location)
        (box_at_loc ?b - box ?l - location)
        (wor_at_loc ?w - workstation ?l - location)
        (con_at_loc_wor ?c - content ?l - location ?w - workstation)
        (adjacent ?l1 - location ?l2 - location)
        (carries ?r - robot ?b - box)
        (contains ?b - box ?c - content)
        (is_being_carried ?b - box)
        (is_carrying ?r - robot)
        (is_full ?b - box)
        (is_in_box ?c - content)
    )

    (:action pick_up
        :parameters (
            ?r - robot
            ?b - box
            ?l - location
        )
        :precondition (and
            (rob_at_loc ?r ?l)
            (box_at_loc ?b ?l)
            (not (is_being_carried ?b))
            (not (is_carrying ?r))
        )
        :effect (and
            (carries ?r ?b)
            (is_being_carried ?b)
            (is_carrying ?r)
            (not (box_at_loc ?b ?l))
        )
    )

    (:action put_down
        :parameters (
            ?r - robot
            ?b - box
            ?l - location
        )
        :precondition (and
            (rob_at_loc ?r ?l)
            (carries ?r ?b)
            (is_carrying ?r)
        )
        :effect (and
            (not (carries ?r ?b))
            (not (is_being_carried ?b))
            (not (is_carrying ?r))
            (box_at_loc ?b ?l)
        )
    )

    (:action move
        :parameters (
            ?r - robot
            ?l1 - location
            ?l2 - location
        )
        :precondition (and
            (rob_at_loc ?r ?l1)
            (adjacent ?l1 ?l2)
        )
        :effect (and
            (rob_at_loc ?r ?l2)
            (not (rob_at_loc ?r ?l1))
        )
    )

    (:action fill_box
        :parameters (
            ?r - robot
            ?b - box
            ?c - content
            ?l - location
            ?w - workstation
        )
        :precondition (and
            (rob_at_loc ?r ?l)
            (wor_at_loc ?w ?l)
            (con_at_loc_wor ?c ?l ?w)
            (carries ?r ?b)
            (is_carrying ?r)
            (is_being_carried ?b)
            (not (is_full ?b))
            (not (is_in_box ?c))
        )
        :effect (and
            (contains ?b ?c)
            (is_full ?b)
            (is_in_box ?c)
            (not (con_at_loc_wor ?c ?l ?w))
        )
    )

    (:action empty_box
        :parameters (
            ?r - robot
            ?b - box
            ?c - content
            ?l - location
            ?w - workstation
        )
        :precondition (and
            (rob_at_loc ?r ?l)
            (wor_at_loc ?w ?l)
            (carries ?r ?b)
            (is_carrying ?r)
            (is_being_carried ?b)
            (contains ?b ?c)
            (is_in_box ?c)
        )
        :effect (and
            (not (is_full ?b))
            (not (contains ?b ?c))
            (not (is_in_box ?c))
            (con_at_loc_wor ?c ?l ?w)
        )
    )
)

; problem
(define (problem testing)
    (:domain problem1)

    (:objects
        loc1 loc2 loc3 loc4 loc5 loc6 loc7 - location
        wor1 wor2_1 wor2_2 wor3 wor4_1 wor4_2 wor4_3 wor5 wor6_1 wor6_2 wor7 - workstation
        box1 box2 - box
        rob1 rob2 - robot
        tool1 tool2 valve1 valve2 bolt1 bolt2 - content
    )

    (:init
        (wor_at_loc central_warehouse_contents central_warehouse)
        (adjacent central_warehouse loc1)
        (adjacent loc1 central_warehouse)
        (adjacent loc1 loc2)
        (adjacent loc2 loc1)
        (adjacent loc1 loc3)
        (adjacent loc3 loc1)
        (adjacent loc2 loc4)
        (adjacent loc4 loc2)
        (adjacent loc2 loc5)
        (adjacent loc5 loc2)
        (adjacent loc3 loc6)
        (adjacent loc6 loc3)
        (adjacent loc3 loc7)
        (adjacent loc7 loc3)

        (wor_at_loc wor1 loc1)
        (wor_at_loc wor2_1 loc2)
        (wor_at_loc wor2_2 loc2)
        (wor_at_loc wor3 loc3)
        (wor_at_loc wor4_1 loc4)
        (wor_at_loc wor4_2 loc4)
        (wor_at_loc wor4_3 loc4)
        (wor_at_loc wor5 loc5)
        (wor_at_loc wor6_1 loc6)
        (wor_at_loc wor6_2 loc6)
        (wor_at_loc wor7 loc7)

        (box_at_loc box1 central_warehouse)
        (box_at_loc box2 central_warehouse)

        (rob_at_loc rob1 central_warehouse)
        (rob_at_loc rob2 central_warehouse)

        (con_at_loc_wor tool1 central_warehouse central_warehouse_contents)
        (con_at_loc_wor tool2 central_warehouse central_warehouse_contents)
        (con_at_loc_wor valve1 central_warehouse central_warehouse_contents)
        (con_at_loc_wor valve2 central_warehouse central_warehouse_contents)
        (con_at_loc_wor bolt1 central_warehouse central_warehouse_contents)
        (con_at_loc_wor bolt2 central_warehouse central_warehouse_contents)
    )

    (:goal
        (and
            (con_at_loc_wor tool2 loc2 wor2_1)
            (con_at_loc_wor tool1 loc4 wor4_2)
            (con_at_loc_wor valve1 loc4 wor4_2)
            (con_at_loc_wor valve2 loc4 wor4_3)
            (con_at_loc_wor bolt1 loc7 wor7)
            (con_at_loc_wor bolt2 loc5 wor5)
        )
    )
)

; plan
1. (move rob2 central_warehouse loc1)
   deleted: (rob_at_loc rob2 central_warehouse)
   added: (rob_at_loc rob2 loc1)
   goals met: 0 of 6
2. (pick_up rob1 box1 central_warehouse)
   deleted: (box_at_loc box1 central_warehouse)
   added: (carries rob1 box1) (is_being_carried box1) (is_carrying rob1)
   goals met: 0 of 6
3. (fill_box rob1 box1 bolt1 central_warehouse central_warehouse_contents)
   deleted: (con_at_loc_wor bolt1 central_warehouse central_warehouse_contents)
   added: (contains box1 bolt1) (is_full box1) (is_in_box bolt1)
   goals met: 0 of 6
4. (move rob1 central_warehouse loc1)
   deleted: (rob_at_loc rob1 central_warehouse)
   added: (rob_at_loc rob1 loc1)
   goals met: 0 of 6
5. (move rob1 loc1 loc3)
   deleted: (rob_at_loc rob1 loc1)
   added: (rob_at_loc rob1 loc3)
   goals met: 0 of 6
6. (move rob1 loc3 loc7)
   deleted: (rob_at_loc rob1 loc3)
   added: (rob_at_loc rob1 loc7)
   goals met: 0 of 6
7. (empty_box rob1 box1 bolt1 loc7 wor7)
   deleted: (is_full box1) (contains box1 bolt1) (is_in_box bolt1)
   added: (con_at_loc_wor bolt1 loc7 wor7)
   goals met: 1 of 6
8. (move rob1 loc7 loc3)
   deleted: (rob_at_loc rob1 loc7)
   added: (rob_at_loc rob1 loc3)
   goals met: 1 of 6
9. (move rob1 loc3 loc1)
   deleted: (rob_at_loc rob1 loc3)
   added: (rob_at_loc rob1 loc1)
   goals met: 1 of 6
10. (move rob1 loc1 central_warehouse)
   deleted: (rob_at_loc rob1 loc1)
   added: (rob_at_loc rob1 central_warehouse)
   goals met: 1 of 6
11. (fill_box rob1 box1 bolt2 central_warehouse central_warehouse_contents)
   deleted: (con_at_loc_wor bolt2 central_warehouse central_warehouse_contents)
   added: (contains box1 bolt2) (is_full box1) (is_in_box bolt2)
   goals met: 1 of 6
12. (move rob1 central_warehouse loc1)
   deleted: (rob_at_loc rob1 central_warehouse)
   added: (rob_at_loc rob1 loc1)
   goals met: 1 of 6
13. (move rob1 loc1 loc2)
   deleted: (rob_at_loc rob1 loc1)
   added: (rob_at_loc rob1 loc2)
   goals met: 1 of 6
14. (move rob1 loc2 loc5)
   deleted: (rob_at_loc rob1 loc2)
   added: (rob_at_loc rob1 loc5)
   goals met: 1 of 6
15. (empty_box rob1 box1 bolt2 loc5 wor5)
   deleted: (is_full box1) (contains box1 bolt2) (is_in_box bolt2)
   added: (con_at_loc_wor bolt2 loc5 wor5)
   goals met: 2 of 6
16. (move rob1 loc5 loc2)
   deleted: (rob_at_loc rob1 loc5)
   added: (rob_at_loc rob1 loc2)
   goals met: 2 of 6
17. (move rob1 loc2 loc1)
   deleted: (rob_at_loc rob1 loc2)
   added: (rob_at_loc rob1 loc1)
   goals met: 2 of 6
18. (move rob1 loc1 central_warehouse)
   deleted: (rob_at_loc rob1 loc1)
   added: (rob_at_loc rob1 central_warehouse)
   goals met: 2 of 6
19. (fill_box rob1 box1 tool1 central_warehouse central_warehouse_contents)
   deleted: (con_at_loc_wor tool1 central_warehouse central_warehouse_contents)
   added: (contains box1 tool1) (is_full box1) (is_in_box tool1)
   goals met: 2 of 6
20. (move rob1 central_warehouse loc1)
   deleted: (rob_at_loc rob1 central_warehouse)
   added: (rob_at_loc rob1 loc1)
   goals met: 2 of 6
21. (move rob1 loc1 loc2)
   deleted: (rob_at_loc rob1 loc1)
   added: (rob_at_loc rob1 loc2)
   goals met: 2 of 6
22. (move rob1 loc2 loc4)
   deleted: (rob_at_loc rob1 loc2)
   added: (rob_at_loc rob1 loc4)
   goals met: 2 of 6
23. (empty_box rob1 box1 tool1 loc4 wor4_2)
   deleted: (is_full box1) (contains box1 tool1) (is_in_box tool1)
   added: (con_at_loc_wor tool1 loc4 wor4_2)
   goals met: 3 of 6
24. (move rob1 loc4 loc2)
   deleted: (rob_at_loc rob1 loc4)
   added: (rob_at_loc rob1 loc2)
   goals met: 3 of 6
25. (move rob1 loc2 loc1)
   deleted: (rob_at_loc rob1 loc2)
   added: (rob_at_loc rob1 loc1)
   goals met: 3 of 6
26. (move rob1 loc1 central_warehouse)
   deleted: (rob_at_loc rob1 loc1)
   added: (rob_at_loc rob1 central_warehouse)
   goals met: 3 of 6
27. (fill_box rob1 box1 tool2 central_warehouse central_warehouse_contents)
   deleted: (con_at_loc_wor tool2 central_warehouse central_warehouse_contents)
   added: (contains box1 tool2) (is_full box1) (is_in_box tool2)
   goals met: 3 of 6
28. (move rob1 central_warehouse loc1)
   deleted: (rob_at_loc rob1 central_warehouse)
   added: (rob_at_loc rob1 loc1)
   goals met: 3 of 6
29. (move rob1 loc1 loc2)
   deleted: (rob_at_loc rob1 loc1)
   added: (rob_at_loc rob1 loc2)
   goals met: 3 of 6
30. (empty_box rob1 box1 tool2 loc2 wor2_1)
   deleted: (is_full box1) (contains box1 tool2) (is_in_box tool2)
   added: (con_at_loc_wor tool2 loc2 wor2_1)
   goals met: 4 of 6
31. (move rob1 loc2 loc1)
   deleted: (rob_at_loc rob1 loc2)
   added: (rob_at_loc rob1 loc1)
   goals met: 4 of 6
32. (move rob1 loc1 central_warehouse)
   deleted: (rob_at_loc rob1 loc1)
   added: (rob_at_loc rob1 central_warehouse)
   goals met: 4 of 6
33. (fill_box rob1 box1 valve1 central_warehouse central_warehouse_contents)
   deleted: (con_at_loc_wor valve1 central_warehouse central_warehouse_contents)
   added: (contains box1 valve1) (is_full box1) (is_in_box valve1)
   goals met: 4 of 6
34. (move rob1 central_warehouse loc1)
   deleted: (rob_at_loc rob1 central_warehouse)
   added: (rob_at_loc rob1 loc1)
   goals met: 4 of 6
35. (move rob1 loc1 loc2)
   deleted: (rob_at_loc rob1 loc1)
   added: (rob_at_loc rob1 loc2)
   goals met: 4 of 6
36. (move rob1 loc2 loc4)
   deleted: (rob_at_loc rob1 loc2)
   added: (rob_at_loc rob1 loc4)
   goals met: 4 of 6
37. (empty_box rob1 box1 valve1 loc4 wor4_2)
   deleted: (is_full box1) (contains box1 valve1) (is_in_box valve1)
   added: (con_at_loc_wor valve1 loc4 wor4_2)
   goals met: 5 of 6
38. (move rob1 loc4 loc2)
   deleted: (rob_at_loc rob1 loc4)
   added: (rob_at_loc rob1 loc2)
   goals met: 5 of 6
39. (move rob1 loc2 loc1)
   deleted: (rob_at_loc rob1 loc2)
   added: (rob_at_loc rob1 loc1)
   goals met: 5 of 6
40. (move rob1 loc1 central_warehouse)
   deleted: (rob_at_loc rob1 loc1)
   added: (rob_at_loc rob1 central_warehouse)
   goals met: 5 of 6
41. (fill_box rob1 box1 valve2 central_warehouse central_warehouse_contents)
   deleted: (con_at_loc_wor valve2 central_warehouse central_warehouse_contents)
   added: (contains box1 valve2) (is_full box1) (is_in_box valve2)
   goals met: 5 of 6
42. (move rob1 central_warehouse loc1)
   deleted: (rob_at_loc rob1 central_warehouse)
   added: (rob_at_loc rob1 loc1)
   goals met: 5 of 6
43. (move rob1 loc1 loc2)
   deleted: (rob_at_loc rob1 loc1)
   added: (rob_at_loc rob1 loc2)
   goals met: 5 of 6
44. (move rob1 loc2 loc4)
   deleted: (rob_at_loc rob1 loc2)
   added: (rob_at_loc rob1 loc4)
   goals met: 5 of 6
45. (empty_box rob1 box1 valve2 loc4 wor4_3)
   deleted: (is_full box1) (contains box1 valve2) (is_in_box valve2)
   added: (con_at_loc_wor valve2 loc4 wor4_3)
   goals met: 6 of 6
